0. Import numpy and pandas.

In [1]:
import numpy as np
import pandas as pd

1. Create a pandas series object, `s1`, from the following list of (actual) tickers: BOOM, YUM, EAT, WOOF, LUV, ZEUS, COOL, FUN

In [2]:
s1 = pd.Series(['BOOM', 'YUM', 'EAT', 'WOOF', 'LUV', 'ZEUS', 'COOL', 'FUN'])
s1

0    BOOM
1     YUM
2     EAT
3    WOOF
4     LUV
5    ZEUS
6    COOL
7     FUN
dtype: object

2. Create a matrix, `M1`, that is 8 rows by 4 columns.  
 - Use `randn` and multiply by 1000.  
 - Set seed=1.
 - Take the absolute value of each element.

In [3]:
np.random.seed(1)
M1 = np.random.randn(8, 4) * 1000
M1 = np.abs(M1)
M1

array([[1624.34536366,  611.75641365,  528.17175226, 1072.96862216],
       [ 865.40762932, 2301.53869688, 1744.81176422,  761.2069009 ],
       [ 319.03909606,  249.37037548, 1462.10793704, 2060.1407095 ],
       [ 322.41720401,  384.05435467, 1133.76944234, 1099.89126731],
       [ 172.42820755,  877.85841792,   42.21374672,  582.81521372],
       [1100.61917721, 1144.72370984,  901.59072059,  502.4943389 ],
       [ 900.85594926,  683.72785917,  122.89022552,  935.76943426],
       [ 267.88807963,  530.35546674,  691.66075173,  396.75352686]])

3. Create a list, `cols`, with the following elements: sale, cogs, sga, opinc

In [4]:
cols = ['sale', 'cogs', 'sga', 'opinc']
cols

['sale', 'cogs', 'sga', 'opinc']

4. Create a Pandas DataFrame from `M1`, `s1`, and `cols`. Name the DataFrame, `df1`.

In [5]:
df1 = pd.DataFrame(M1, s1, cols)
df1

             sale         cogs          sga        opinc
BOOM  1624.345364   611.756414   528.171752  1072.968622
YUM    865.407629  2301.538697  1744.811764   761.206901
EAT    319.039096   249.370375  1462.107937  2060.140709
WOOF   322.417204   384.054355  1133.769442  1099.891267
LUV    172.428208   877.858418    42.213747   582.815214
ZEUS  1100.619177  1144.723710   901.590721   502.494339
COOL   900.855949   683.727859   122.890226   935.769434
FUN    267.888080   530.355467   691.660752   396.753527

5. Remove (reset) the index for `df1`; rename the column.

In [6]:
df1.reset_index(inplace=True)
df1.rename(columns={'index':'ticker'}, inplace=True)
df1

  ticker         sale         cogs          sga        opinc
0   BOOM  1624.345364   611.756414   528.171752  1072.968622
1    YUM   865.407629  2301.538697  1744.811764   761.206901
2    EAT   319.039096   249.370375  1462.107937  2060.140709
3   WOOF   322.417204   384.054355  1133.769442  1099.891267
4    LUV   172.428208   877.858418    42.213747   582.815214
5   ZEUS  1100.619177  1144.723710   901.590721   502.494339
6   COOL   900.855949   683.727859   122.890226   935.769434
7    FUN   267.888080   530.355467   691.660752   396.753527

6. Using .iloc(), create a new DataFrame, `df2`, consisting of just the first two (leftmost) columns.

In [7]:
df2 = df1.iloc[:, :2]
df2

  ticker         sale
0   BOOM  1624.345364
1    YUM   865.407629
2    EAT   319.039096
3   WOOF   322.417204
4    LUV   172.428208
5   ZEUS  1100.619177
6   COOL   900.855949
7    FUN   267.888080

7. Create a new DataFrame, `df3`, that is a subset of `df1` with the following columns: ticker, cogs, sga.

In [8]:
df3 = df1.loc[:, ['ticker', 'cogs', 'sga']]
df3

  ticker         cogs          sga
0   BOOM   611.756414   528.171752
1    YUM  2301.538697  1744.811764
2    EAT   249.370375  1462.107937
3   WOOF   384.054355  1133.769442
4    LUV   877.858418    42.213747
5   ZEUS  1144.723710   901.590721
6   COOL   683.727859   122.890226
7    FUN   530.355467   691.660752